{
"@context": {
    "iata": "http://www.onerecordcargo.org/schema/"
},
    "iata:otherChargeCode": {
        "type": "T",
        "description": "Code identifying the type of an individual charge. The combination of 'Other Charge Code' and 'Charge Entitlement Code Party' cannot be duplicated (another combination of the same Other Charge Code and the same Entitlement Code is not allowed)",
        "XML field code": "OTH002x"
    },
    "iata:otherChargeDueParty": {
        "type": "T",
        "description": "Coded identification of the recipient of a charge amount .The combination of 'Other Charge Code' and 'Charge Entitlement Code Party' cannot be duplicated (another combination of the same Other Charge Code and the same Entitlement Code is not allowed)",
        "XML field code": "OTH003x"
    },
    "iata:otherChargeSubCode": {
        "type": "T",
        "description": "Code that further qualify the type an individual charge. (Internal code)",
        "XML field code": "OTH005x"
    },
    "iata:otherChargePrepaidCollectIndicator": {
        "type": "T",
        "description": "Code indicating whether the payment of Other Charges will be made at origin (prepaid) or at destination (collect). True value indicates that payment is made at origin (prepaid) and false refers to payment at destination (collect)",
        "XML field code": "OTH001x"
    },
    "iata:otherChargeLocationIndicator": {
        "type": "T",
        "description": "Indicates if the Other Charge Location is Origin (O) or Transit (T) or Destination(D) Destination is only valid if the Other Charge Payment Code indicates collect. Currency of the Charge amount is Destination Currency with the Other Charge Payment Indicator is collect and the Other Charge Origin or Destination Indicator indicates Destination; otherwise the Charge amount is in origin currency. Values: O - Used for Prepaid and Collect origin charges. The currency code associated with the Charge Amount should be the origin currency code. T - Used for prepaid or collect enroute charges. The currency amount associated with the Charge Amount should be the origin currency code for prepaid or destination currency code for collect charges. D - Used for Destination Collect charges. The currency amount associated with the Charge Amount should be the destination currency code",
        "XML field code": "OTH006x"
    },
    "iata:otherChargeReasonDescription": {
        "type": "T",
        "description": "Describes the reason of the individual charge",
        "XML field code": "OTH007x"
    },
    "iata:otherChargeAmount": {
        "type": "N",
        "description": "",
        "XML field code": "OTH042x"
    },
    "iata:otherChargeByTime": {
        "type": "N",
        "description": "Total amount of time for which other local charge is applied",
        "XML field code": "OTH051x"
    },
    "iata:otherChargeByItemQuantity": {
        "type": "N",
        "description": "Total number of items for which Other Local Charge is applied.",
        "XML field code": "OTH052x"
    },
    "iata:otherChargeDate": {
        "type": "D",
        "description": "Date of Pickup/Delivery service to be performed",
        "XML field code": "OTH053x"
    },
    "iata:otherChargeSpecialService": {
        "type": "T",
        "description": "Details of Special Service associated with the Other/Local Charge",
        "XML field code": "OTH054x"
    },
    "iata:otherChargeSpecialTime": {
        "type": "N",
        "description": "Details of Special time for Special Service e.g. Pickup time, Delivery Time etc.",
        "XML field code": "OTH055x"
    }
}
